#+LATEX_HEADER: \usepackage[boxed, lined]{algorithm2e}
# #+LATEX_HEADER: \usepackage{minted}
# #+LATEX_HEADER: \usepackage{float}
#+PORPERTY: RANDOM

# freemind
# .sdcv_history
# agenda
# obj

*** DONE 测试卡片电脑连接 IMU
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-03-04 五 15:51]
- State "NEXT"       from ""           [2016-03-04 五 10:13] \\
  阅读手册，直接通过串口连接 IMU
CLOCK: [2016-03-04 五 09:40]--[2016-03-04 五 10:13] =>  0:33
:END:

1. 安装 ros-indigo-microstrain-3dmgx2-imu OK

2. 测试连接

   1) 卡片电脑，无 /dev/ttyUSB0
   2) 台式机，有 /dev/ttyUSB0, 说明 IMU 连线不存在问题, ROS 节点读取数
      据亦OK
   3) 使用 usb-serial 转接
      - 驱动预安装，OK
        #+BEGIN_EXAMPLE
        Bus 002 Device 002: ID 1a86:7523 QinHeng Electronics HL-340 USB-Serial adapter
        #+END_EXAMPLE
      - 连接 IMU，读出 /dev/ttyUSB0 !!!
   4) OK

3. 测试 ROS 节点，OK

   - IMU 初始化大约需要 20s

4. 关闭节点以及 Ros master 后，IMU 显示依然在读取数据？？

   - 原因是切换到后台后 使用 kill 关闭，可能导致不完全
   - 在前台关闭则没有出现类似情况
   - 切换到前台关闭也 OK

5. 通过串口直接连接IMU

   查看串口设备
   #+BEGIN_EXAMPLE
   dmesg | grep ttyS*
   #+END_EXAMPLE

   经测为 ttyS1

   通过远程连接有如下 warning

   #+BEGIN_EXAMPLE
     [ WARN] [1457077522.141754754]: Exception thrown while trying to get the IMU reading. This sometimes happens due to a communication glitch, or if another process is trying to access the IMU port. You may try 'lsof|grep /dev/ttyS1' to see if other processes have the port open. invalid checksum.
     Make sure the IMU sensor is connected to this computer. (in microstrain_3dmgx2_imu::IMU:receive)
   #+END_EXAMPLE

*** NEXT ttyUSB 是什么？以及 IMU 手册阅读
:LOGBOOK:
- State "NEXT"       from "TODO"       [2016-03-04 五 10:50] \\
  没有搞明白
CLOCK: [2016-03-04 五 10:24]--[2016-03-04 五 10:50] =>  0:26
:END:

*** TCB UTM30LX-EW 连接测试
:LOGBOOK:
- State "TCB"        from "NEXT"       [2016-03-04 五 14:50] \\
  下一步通过文件自动配置网络，而不是使用GUI手动配置
- State "NEXT"       from ""           [2016-03-04 五 11:50] \\
  暂时没有成功
CLOCK: [2016-03-04 五 11:03]--[2016-03-04 五 11:49] =>  0:46
:END:

http://answers.ros.org/question/212527/hokuyo-utm-30lx-ew-laser-scanner-problems-to-detect/

卡片电脑未关闭系统直接断电(误操作)后，再上电，电脑直接启动，未短路触发。

1. 安装 urg_node, OK
2. ping not ok
3. IP 配置


*配置的是 eth0 的 IP，掩码和路由，与 wlan0 无关（独立）*

- IP: 192.168.0.15
- Mask: 255.255.255.0
- GateWay： 192.168.0.1

通过GUI配置有线网络连接 OK

